base_simulation/0.orig/ReThetat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1000;  //  ReTheta = 1173.51-589.428*Tu+0.2196/Tu² = 584.302   with   Tu = 100*sqrt(2/3*k)/|U| = 1 // try Rethetat = 1000  as in Müller et al.

boundaryField
{
    outerBoundary
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    airfoil
    {
        type            zeroGradient;
    }

    Front
    {
        type            empty;
    }

    Back
    {
        type            empty;
    }
    
    processor
    {
        type  processor;
        value $internalField;
    }
}


// ************************************************************************* //
