base_simulation/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        FDIC;
        tolerance       1e-7;
        relTol          0.01;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "(k|omega|U)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.01;
    }

    "(k|omega|U)Final"
    {
        $U;
        relTol          0;
    }

    /*
    "(ReThetat|gammaInt)"
    {
        solver          GAMG;
        tolerance       1e-07;
        relTol          0.01;
        smoother        GaussSeidel;
    }
    */

    Phi
    {
        $p;
    }

    cellDisplacement
    {
    	solver          GAMG;
    	smoother        GaussSeidel;
    	tolerance       1e-7;
    	relTol          0.01;
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors 3;
}

SIMPLE
{
    nCorrectors         1;
    nNonOrthogonalCorrectors 1;
    consistent          yes;

    residualControl
    {
        p               1e-4;
        U               1e-5;
        k               1e-5;
        omega           1e-5;
    }

}

relaxationFactors
{ 
    fields
    {
        p               0.2;
    }

    equations
    {
        U               0.7;
        k               0.7;
        omega           0.7;
    }

}

// ************************************************************************* //
